cmsis-svd/cmsis-svd/data/Nuvoton/NUC100CN_v1.svd
       <register derivedFrom="GPIOA_PMD">
          <name>GPIOE_PMD</name>
          <displayName>GPIOE_PMD</displayName>
          <description>GPIO Port E Pin I/O Mode Control</description>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="GPIOA_OFFD">
          <name>GPIOE_OFFD</name>
          <displayName>GPIOE_OFFD</displayName>
          <description>GPIO Port E Pin Digital Input Path Disable Control</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DOUT">
          <name>GPIOE_DOUT</name>
          <displayName>GPIOE_DOUT</displayName>
          <description>GPIO Port E Data Output Value</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DMASK">
          <name>GPIOE_DMASK</name>
          <displayName>GPIOE_DMASK</displayName>
          <description>GPIO Port E Data Output Write Mask</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="GPIOA_PIN">
          <name>GPIOE_PIN</name>
          <displayName>GPIOE_PIN</displayName>
          <description>GPIO Port E Pin Value</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DBEN">
          <name>GPIOE_DBEN</name>
          <displayName>GPIOE_DBEN</displayName>
          <description>GPIO Port E De-bounce Enable</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="GPIOA_IMD">
          <name>GPIOE_IMD</name>
          <displayName>GPIOE_IMD</displayName>
          <description>GPIO Port E Interrupt Mode Control</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="GPIOA_IEN">
          <name>GPIOE_IEN</name>
          <displayName>GPIOE_IEN</displayName>
          <description>GPIO Port E Interrupt Enable</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="GPIOA_ISRC">
          <name>GPIOE_ISRC</name>
          <displayName>GPIOE_ISRC</displayName>
          <description>GPIO Port E Interrupt Source Flag</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register>
          <name>DBNCECON</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DBNCECON</displayName>
          <description>De-bounce Cycle Control</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBCLKSEL</name>
              <description>De-bounce sampling cycle selection\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBCLKSRC</name>
              <description>De-bounce counter clock source select\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>De-bounce counter clock source is the HCLK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>De-bounce counter clock source is the internal 10 kHz low speed oscillator</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ICLK_ON</name>
              <description>Interrupt clock On mode\nIt is recommended to turn off this bit to save system power, if on special application concern.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Edge detection circuit is active only if the I/O pin corresponding to GPIOx_IEN bit is set to 1</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All I/O pins edge detection circuit is always active after reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PA0_PDIO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PA0_PDIO</displayName>
          <description>GPIO PA.0 Pin Data I/O</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Pxn_PDIO</name>
              <description>GPIO Px.n Pin Data I/O\nWrite this bit can control one GPIO pin output value\nRead this register to get GPIO pin status.\nFor example: write PA0_PDIO will reflect the written value to bit GPIOA_DOUT[0], read PA0_PDIO will return the value of GPIOA_PIN[0]\nNote: The write operation will not be affected by register GPIOx_DMASK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set corresponding GPIO pin to low</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set corresponding GPIO pin to high</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA1_PDIO</name>
          <displayName>PA1_PDIO</displayName>
          <description>GPIO PA.1 Pin Data I/O</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA2_PDIO</name>
          <displayName>PA2_PDIO</displayName>
          <description>GPIO PA.2 Pin Data I/O</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA3_PDIO</name>
          <displayName>PA3_PDIO</displayName>
          <description>GPIO PA.3 Pin Data I/O</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA4_PDIO</name>
          <displayName>PA4_PDIO</displayName>
          <description>GPIO PA.4 Pin Data I/O</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA5_PDIO</name>
          <displayName>PA5_PDIO</displayName>
          <description>GPIO PA.5 Pin Data I/O</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA6_PDIO</name>
          <displayName>PA6_PDIO</displayName>
          <description>GPIO PA.6 Pin Data I/O</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA7_PDIO</name>
          <displayName>PA7_PDIO</displayName>
          <description>GPIO PA.7 Pin Data I/O</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA8_PDIO</name>
          <displayName>PA8_PDIO</displayName>
          <description>GPIO PA.8 Pin Data I/O</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA9_PDIO</name>
          <displayName>PA9_PDIO</displayName>
          <description>GPIO PA.9 Pin Data I/O</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA10_PDIO</name>
          <displayName>PA10_PDIO</displayName>
          <description>GPIO PA.10 Pin Data I/O</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA11_PDIO</name>
          <displayName>PA11_PDIO</displayName>
          <description>GPIO PA.11 Pin Data I/O</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA12_PDIO</name>
          <displayName>PA12_PDIO</displayName>
          <description>GPIO PA.12 Pin Data I/O</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA13_PDIO</name>
          <displayName>PA13_PDIO</displayName>
          <description>GPIO PA.13 Pin Data I/O</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA14_PDIO</name>
          <displayName>PA14_PDIO</displayName>
          <description>GPIO PA.14 Pin Data I/O</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PA15_PDIO</name>
          <displayName>PA15_PDIO</displayName>
          <description>GPIO PA.15 Pin Data I/O</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB0_PDIO</name>
          <displayName>PB0_PDIO</displayName>
          <description>GPIO PB.0 Pin Data I/O</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB1_PDIO</name>
          <displayName>PB1_PDIO</displayName>
          <description>GPIO PB.1 Pin Data I/O</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB2_PDIO</name>
          <displayName>PB2_PDIO</displayName>
          <description>GPIO PB.2 Pin Data I/O</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB3_PDIO</name>
          <displayName>PB3_PDIO</displayName>
          <description>GPIO PB.3 Pin Data I/O</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB4_PDIO</name>
          <displayName>PB4_PDIO</displayName>
          <description>GPIO PB.4 Pin Data I/O</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB5_PDIO</name>
          <displayName>PB5_PDIO</displayName>
          <description>GPIO PB.5 Pin Data I/O</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB6_PDIO</name>
          <displayName>PB6_PDIO</displayName>
          <description>GPIO PB.6 Pin Data I/O</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB7_PDIO</name>
          <displayName>PB7_PDIO</displayName>
          <description>GPIO PB.7 Pin Data I/O</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB8_PDIO</name>
          <displayName>PB8_PDIO</displayName>
          <description>GPIO PB.8 Pin Data I/O</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB9_PDIO</name>
          <displayName>PB9_PDIO</displayName>
          <description>GPIO PB.9 Pin Data I/O</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB10_PDIO</name>
          <displayName>PB10_PDIO</displayName>
          <description>GPIO PB.10 Pin Data I/O</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB11_PDIO</name>
          <displayName>PB11_PDIO</displayName>
          <description>GPIO PB.11 Pin Data I/O</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB12_PDIO</name>
          <displayName>PB12_PDIO</displayName>
          <description>GPIO PB.12 Pin Data I/O</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB13_PDIO</name>
          <displayName>PB13_PDIO</displayName>
          <description>GPIO PB.13 Pin Data I/O</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB14_PDIO</name>
          <displayName>PB14_PDIO</displayName>
          <description>GPIO PB.14 Pin Data I/O</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PB15_PDIO</name>
          <displayName>PB15_PDIO</displayName>
          <description>GPIO PB.15 Pin Data I/O</description>
          <addressOffset>0x27C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC0_PDIO</name>
          <displayName>PC0_PDIO</displayName>
          <description>GPIO PC.0 Pin Data I/O</description>
          <addressOffset>0x280</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC1_PDIO</name>
          <displayName>PC1_PDIO</displayName>
          <description>GPIO PC.1 Pin Data I/O</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC2_PDIO</name>
          <displayName>PC2_PDIO</displayName>
          <description>GPIO PC.2 Pin Data I/O</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC3_PDIO</name>
          <displayName>PC3_PDIO</displayName>
          <description>GPIO PC.3 Pin Data I/O</description>
          <addressOffset>0x28C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC4_PDIO</name>
          <displayName>PC4_PDIO</displayName>
          <description>GPIO PC.4 Pin Data I/O</description>
          <addressOffset>0x290</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC5_PDIO</name>
          <displayName>PC5_PDIO</displayName>
          <description>GPIO PC.5 Pin Data I/O</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC6_PDIO</name>
          <displayName>PC6_PDIO</displayName>
          <description>GPIO PC.6 Pin Data I/O</description>
          <addressOffset>0x298</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC7_PDIO</name>
          <displayName>PC7_PDIO</displayName>
          <description>GPIO PC.7 Pin Data I/O</description>
          <addressOffset>0x29C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC8_PDIO</name>
          <displayName>PC8_PDIO</displayName>
          <description>GPIO PC.8 Pin Data I/O</description>
          <addressOffset>0x2A0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC9_PDIO</name>
          <displayName>PC9_PDIO</displayName>
          <description>GPIO PC.9 Pin Data I/O</description>
          <addressOffset>0x2A4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC10_PDIO</name>
          <displayName>PC10_PDIO</displayName>
          <description>GPIO PC.10 Pin Data I/O</description>
          <addressOffset>0x2A8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC11_PDIO</name>
          <displayName>PC11_PDIO</displayName>
          <description>GPIO PC.11 Pin Data I/O</description>
          <addressOffset>0x2AC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC12_PDIO</name>
          <displayName>PC12_PDIO</displayName>
          <description>GPIO PC.12 Pin Data I/O</description>
          <addressOffset>0x2B0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC13_PDIO</name>
          <displayName>PC13_PDIO</displayName>
          <description>GPIO PC.13 Pin Data I/O</description>
          <addressOffset>0x2B4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC14_PDIO</name>
          <displayName>PC14_PDIO</displayName>
          <description>GPIO PC.14 Pin Data I/O</description>
          <addressOffset>0x2B8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PC15_PDIO</name>
          <displayName>PC15_PDIO</displayName>
          <description>GPIO PC.15 Pin Data I/O</description>
          <addressOffset>0x2BC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD0_PDIO</name>
          <displayName>PD0_PDIO</displayName>
          <description>GPIO PD.0 Pin Data I/O</description>
          <addressOffset>0x2C0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD1_PDIO</name>
          <displayName>PD1_PDIO</displayName>
          <description>GPIO PD.1 Pin Data I/O</description>
          <addressOffset>0x2C4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD2_PDIO</name>
          <displayName>PD2_PDIO</displayName>
          <description>GPIO PD.2 Pin Data I/O</description>
          <addressOffset>0x2C8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD3_PDIO</name>
          <displayName>PD3_PDIO</displayName>
          <description>GPIO PD.3 Pin Data I/O</description>
          <addressOffset>0x2CC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD4_PDIO</name>
          <displayName>PD4_PDIO</displayName>
          <description>GPIO PD.4 Pin Data I/O</description>
          <addressOffset>0x2D0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD5_PDIO</name>
          <displayName>PD5_PDIO</displayName>
          <description>GPIO PD.5 Pin Data I/O</description>
          <addressOffset>0x2D4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD6_PDIO</name>
          <displayName>PD6_PDIO</displayName>
          <description>GPIO PD.6 Pin Data I/O</description>
          <addressOffset>0x2D8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD7_PDIO</name>
          <displayName>PD7_PDIO</displayName>
          <description>GPIO PD.7 Pin Data I/O</description>
          <addressOffset>0x2DC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD8_PDIO</name>
          <displayName>PD8_PDIO</displayName>
          <description>GPIO PD.8 Pin Data I/O</description>
          <addressOffset>0x2E0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD9_PDIO</name>
          <displayName>PD9_PDIO</displayName>
          <description>GPIO PD.9 Pin Data I/O</description>
          <addressOffset>0x2E4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD10_PDIO</name>
          <displayName>PD10_PDIO</displayName>
          <description>GPIO PD.10 Pin Data I/O</description>
          <addressOffset>0x2E8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD11_PDIO</name>
          <displayName>PD11_PDIO</displayName>
          <description>GPIO PD.11 Pin Data I/O</description>
          <addressOffset>0x2EC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD12_PDIO</name>
          <displayName>PD12_PDIO</displayName>
          <description>GPIO PD.12 Pin Data I/O</description>
          <addressOffset>0x2F0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD13_PDIO</name>
          <displayName>PD13_PDIO</displayName>
          <description>GPIO PD.13 Pin Data I/O</description>
          <addressOffset>0x2F4</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD14_PDIO</name>
          <displayName>PD14_PDIO</displayName>
          <description>GPIO PD.14 Pin Data I/O</description>
          <addressOffset>0x2F8</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PD15_PDIO</name>
          <displayName>PD15_PDIO</displayName>
          <description>GPIO PD.15 Pin Data I/O</description>
          <addressOffset>0x2FC</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE0_PDIO</name>
          <displayName>PE0_PDIO</displayName>
          <description>GPIO PE.0 Pin Data I/O</description>
          <addressOffset>0x300</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE1_PDIO</name>
          <displayName>PE1_PDIO</displayName>
          <description>GPIO PE.1 Pin Data I/O</description>
          <addressOffset>0x304</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE2_PDIO</name>
          <displayName>PE2_PDIO</displayName>
          <description>GPIO PE.2 Pin Data I/O</description>
          <addressOffset>0x308</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE3_PDIO</name>
          <displayName>PE3_PDIO</displayName>
          <description>GPIO PE.3 Pin Data I/O</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE4_PDIO</name>
          <displayName>PE4_PDIO</displayName>
          <description>GPIO PE.4 Pin Data I/O</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE5_PDIO</name>
          <displayName>PE5_PDIO</displayName>
          <description>GPIO PE.5 Pin Data I/O</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE6_PDIO</name>
          <displayName>PE6_PDIO</displayName>
          <description>GPIO PE.6 Pin Data I/O</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PE7_PDIO</name>
          <displayName>PE7_PDIO</displayName>
          <description>GPIO PE.7 Pin Data I/O</description>
          <addressOffset>0x31C</addressOffset>
       </register>
